{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "batch_input_shape": [null, 5, 33], "mask_value": -1, "trainable": true, "name": "masking_1"}}, {"class_name": "LSTM", "config": {"use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "return_sequences": false, "name": "lstm_1", "units": 32, "unroll": false, "activation": "tanh", "go_backwards": false, "return_state": false, "recurrent_dropout": 0.0, "stateful": false, "bias_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "dropout": 0.2, "unit_forget_bias": true, "recurrent_constraint": null, "kernel_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"activation": "linear", "use_bias": true, "units": 18, "kernel_constraint": null, "batch_input_shape": [null, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "keras_version": "2.1.6"}